# Напишите программу, которая определит позицию второго вхождения строки в списке, либо сообщит, что ее нет.
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем "qwe" ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем "йцу" ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"] ищем "йцу" ответ: -1
# список: ["123", "234", 123, "567"] ищем "123" ответ: -1
# список: [] ищем "123" ответ: -1


# my_list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
# count = 0
# for i in range(len(my_list)):
#     if my_list[i] == "йцу":
#         count += 1
#         if count > 1:
#             print(f'индекс второго вхождения: {i}')
#             break

# второй вариант
def get_2nd_pos(list1, strg):
    result = -1
    count = 0
    for i in range(len(list1)):
        if list1[i] == strg:
            count += 1
            if count == 2:
                result = i
    return result

list1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
strg = "йцу"

print(get_2nd_pos(list1, strg))